uLipe/psoc_engine_sensor/engine_speed_sensor.cydsn/codegentemp/engine_sensor_adc_UABH_A_regs.h
/*check results of mapping
1. All vin mapped
2. x0,x1,x2, and x3 are in range of 0 to 3
3. x0,x1,x2, and x3 are unique
*/
#if !( (engine_sensor_adc_UABH_A__X4_FLAGS==0xF) && \
    ( (0<=engine_sensor_adc_UABH_A_X0) && (engine_sensor_adc_UABH_A_X0<=3) ) && \
    ( (0<=engine_sensor_adc_UABH_A_X1) && (engine_sensor_adc_UABH_A_X1<=3) ) && \
    ( (0<=engine_sensor_adc_UABH_A_X2) && (engine_sensor_adc_UABH_A_X2<=3) ) && \
    ( (0<=engine_sensor_adc_UABH_A_X3) && (engine_sensor_adc_UABH_A_X3<=3) ) && \
    (engine_sensor_adc_UABH_A_X0!=engine_sensor_adc_UABH_A_X1) && \
    (engine_sensor_adc_UABH_A_X1!=engine_sensor_adc_UABH_A_X2) && \
    (engine_sensor_adc_UABH_A_X2!=engine_sensor_adc_UABH_A_X3) )
#error "bad x input to vin mapping"
#endif

#define engine_sensor_adc_UABH_A_XIN_COUNT 4UL



/* UAB half shared switch assymmetry special cases */
#define engine_sensor_adc_UABH_A_AGND_TIED_ADDR (engine_sensor_adc_UABH_A_halfuab__AGND_TIED)
#define engine_sensor_adc_UABH_A_AGND_TIED_PTR  ((reg32*)engine_sensor_adc_UABH_A_AGND_TIED_ADDR)
#define engine_sensor_adc_UABH_A_AGND_TIED_REG  (*(engine_sensor_adc_UABH_A_AGND_TIED_PTR))

#define engine_sensor_adc_UABH_A_REF_TIED_PTR  ((reg32*)engine_sensor_adc_UABH_A_halfuab__REF_TIED)
#define engine_sensor_adc_UABH_A_REF_TIED_REG  (*(engine_sensor_adc_UABH_A_REF_TIED_PTR))

#define engine_sensor_adc_UABH_A_SW_AA_PTR     ((reg32*)engine_sensor_adc_UABH_A_halfuab__SW_AA)
#define engine_sensor_adc_UABH_A_SW_AA_REG     (*(engine_sensor_adc_UABH_A_SW_AA_PTR))

#define engine_sensor_adc_UABH_A_SW_BB_PTR     ((reg32*)engine_sensor_adc_UABH_A_halfuab__SW_BB)
#define engine_sensor_adc_UABH_A_SW_BB_REG     (*(engine_sensor_adc_UABH_A_SW_BB_PTR))

#define engine_sensor_adc_UABH_A_SW_CC_ADDR     (engine_sensor_adc_UABH_A_halfuab__SW_CC)
#define engine_sensor_adc_UABH_A_SW_CC_PTR     ((reg32*)engine_sensor_adc_UABH_A_SW_CC_ADDR)
#define engine_sensor_adc_UABH_A_SW_CC_REG     (*(engine_sensor_adc_UABH_A_SW_CC_PTR))

#define engine_sensor_adc_UABH_A_ISPAIRED      (engine_sensor_adc_UABH_A_halfuab__ISPAIRED)

#define engine_sensor_adc_UABH_A_UAB_CTRL_ADDR                 (engine_sensor_adc_UABH_A_halfuab__UAB_CTRL)
#define engine_sensor_adc_UABH_A_UAB_CTRL_PTR                 ((reg32*)engine_sensor_adc_UABH_A_UAB_CTRL_ADDR)
#define engine_sensor_adc_UABH_A_UAB_CTRL_REG                 (*(engine_sensor_adc_UABH_A_UAB_CTRL_PTR))

#define engine_sensor_adc_UABH_A_INTR_ADDR                     (engine_sensor_adc_UABH_A_halfuab__INTR)
#define engine_sensor_adc_UABH_A_INTR_PTR                     ((reg32*)engine_sensor_adc_UABH_A_INTR_ADDR)
#define engine_sensor_adc_UABH_A_INTR_REG                     (*(engine_sensor_adc_UABH_A_INTR_PTR))

#define engine_sensor_adc_UABH_A_INTR_SET_ADDR                 (engine_sensor_adc_UABH_A_halfuab__INTR_SET)
#define engine_sensor_adc_UABH_A_INTR_SET_PTR                 ((reg32*)engine_sensor_adc_UABH_A_INTR_SET_ADDR)
#define engine_sensor_adc_UABH_A_INTR_SET_REG                 (*(engine_sensor_adc_UABH_A_INTR_SET_PTR))

#define engine_sensor_adc_UABH_A_INTR_MASK_ADDR                (engine_sensor_adc_UABH_A_halfuab__INTR_MASK)
#define engine_sensor_adc_UABH_A_INTR_MASK_PTR                ((reg32*)engine_sensor_adc_UABH_A_INTR_MASK_ADDR)
#define engine_sensor_adc_UABH_A_INTR_MASK_REG                (*(engine_sensor_adc_UABH_A_INTR_MASK_PTR))

#define engine_sensor_adc_UABH_A_INTR_MASKED_ADDR              (engine_sensor_adc_UABH_A_halfuab__INTR_MASKED)
#define engine_sensor_adc_UABH_A_INTR_MASKED_PTR              ((reg32*)engine_sensor_adc_UABH_A_INTR_MASKED_ADDR)
#define engine_sensor_adc_UABH_A_INTR_MASKED_REG              (*(engine_sensor_adc_UABH_A_INTR_MASKED_PTR))

#define engine_sensor_adc_UABH_A_OA_CTRL_ADDR                  (engine_sensor_adc_UABH_A_halfuab__OA_CTRL)
#define engine_sensor_adc_UABH_A_OA_CTRL_PTR                  ((reg32*)engine_sensor_adc_UABH_A_OA_CTRL_ADDR)
#define engine_sensor_adc_UABH_A_OA_CTRL_REG                  (*(engine_sensor_adc_UABH_A_OA_CTRL_PTR))

#define engine_sensor_adc_UABH_A_CAP_CTRL_ADDR                 (engine_sensor_adc_UABH_A_halfuab__CAP_CTRL)
#define engine_sensor_adc_UABH_A_CAP_CTRL_PTR                 ((reg32*)engine_sensor_adc_UABH_A_CAP_CTRL_ADDR)
#define engine_sensor_adc_UABH_A_CAP_CTRL_REG                 (*(engine_sensor_adc_UABH_A_CAP_CTRL_PTR))

#define engine_sensor_adc_UABH_A_CAP_ABCF_VAL_ADDR             (engine_sensor_adc_UABH_A_halfuab__CAP_ABCF_VAL)
#define engine_sensor_adc_UABH_A_CAP_ABCF_VAL_PTR             ((reg32*)engine_sensor_adc_UABH_A_CAP_ABCF_VAL_ADDR)
#define engine_sensor_adc_UABH_A_CAP_ABCF_VAL_REG             (*(engine_sensor_adc_UABH_A_CAP_ABCF_VAL_PTR))

#define engine_sensor_adc_UABH_A_CAP_AB_VAL_NXT_ADDR           (engine_sensor_adc_UABH_A_halfuab__CAP_AB_VAL_NXT)
#define engine_sensor_adc_UABH_A_CAP_AB_VAL_NXT_PTR           ((reg32*)engine_sensor_adc_UABH_A_CAP_AB_VAL_NXT_ADDR)
#define engine_sensor_adc_UABH_A_CAP_AB_VAL_NXT_REG           (*(engine_sensor_adc_UABH_A_CAP_AB_VAL_NXT_PTR))

#define engine_sensor_adc_UABH_A_CAP_CF_VAL_NXT_ADDR           (engine_sensor_adc_UABH_A_halfuab__CAP_CF_VAL_NXT)
#define engine_sensor_adc_UABH_A_CAP_CF_VAL_NXT_PTR           ((reg32*)engine_sensor_adc_UABH_A_CAP_CF_VAL_NXT_ADDR)
#define engine_sensor_adc_UABH_A_CAP_CF_VAL_NXT_REG           (*(engine_sensor_adc_UABH_A_CAP_CF_VAL_NXT_PTR))

#define engine_sensor_adc_UABH_A_STARTUP_DELAY_ADDR            (engine_sensor_adc_UABH_A_halfuab__STARTUP_DELAY)
#define engine_sensor_adc_UABH_A_STARTUP_DELAY_PTR            ((reg32*)engine_sensor_adc_UABH_A_STARTUP_DELAY_ADDR)
#define engine_sensor_adc_UABH_A_STARTUP_DELAY_REG            (*(engine_sensor_adc_UABH_A_STARTUP_DELAY_PTR))

#define engine_sensor_adc_UABH_A_SUBSAMPLE_CTRL_ADDR           (engine_sensor_adc_UABH_A_halfuab__SUBSAMPLE_CTRL)
#define engine_sensor_adc_UABH_A_SUBSAMPLE_CTRL_PTR           ((reg32*)engine_sensor_adc_UABH_A_SUBSAMPLE_CTRL_ADDR)
#define engine_sensor_adc_UABH_A_SUBSAMPLE_CTRL_REG           (*(engine_sensor_adc_UABH_A_SUBSAMPLE_CTRL_PTR))

#define engine_sensor_adc_UABH_A_SW_STATIC_ADDR               (engine_sensor_adc_UABH_A_halfuab__SW_STATIC )
#define engine_sensor_adc_UABH_A_SW_STATIC_PTR                ((reg32*)engine_sensor_adc_UABH_A_SW_STATIC_ADDR)
#define engine_sensor_adc_UABH_A_SW_STATIC_REG                (*(engine_sensor_adc_UABH_A_SW_STATIC_PTR))

#define engine_sensor_adc_UABH_A_SW_MODBIT_SRC_ADDR            (engine_sensor_adc_UABH_A_halfuab__SW_MODBIT_SRC)
#define engine_sensor_adc_UABH_A_SW_MODBIT_SRC_PTR            ((reg32*)engine_sensor_adc_UABH_A_SW_MODBIT_SRC_ADDR)
#define engine_sensor_adc_UABH_A_SW_MODBIT_SRC_REG            (*(engine_sensor_adc_UABH_A_SW_MODBIT_SRC_PTR))

#define engine_sensor_adc_UABH_A_SW_CA_IN0_ADDR                (engine_sensor_adc_UABH_A_halfuab__SW_CA_IN0)
#define engine_sensor_adc_UABH_A_SW_CA_IN0_PTR                ((reg32*)engine_sensor_adc_UABH_A_SW_CA_IN0_ADDR)
#define engine_sensor_adc_UABH_A_SW_CA_IN0_REG                (*(engine_sensor_adc_UABH_A_SW_CA_IN0_PTR))

#define engine_sensor_adc_UABH_A_SW_CA_IN1_ADDR                (engine_sensor_adc_UABH_A_halfuab__SW_CA_IN1)
#define engine_sensor_adc_UABH_A_SW_CA_IN1_PTR                ((reg32*)engine_sensor_adc_UABH_A_SW_CA_IN1_ADDR)
#define engine_sensor_adc_UABH_A_SW_CA_IN1_REG                (*(engine_sensor_adc_UABH_A_SW_CA_IN1_PTR))

#define engine_sensor_adc_UABH_A_SW_CA_TOP_ADDR                (engine_sensor_adc_UABH_A_halfuab__SW_CA_TOP)
#define engine_sensor_adc_UABH_A_SW_CA_TOP_PTR                ((reg32*)engine_sensor_adc_UABH_A_SW_CA_TOP_ADDR)
#define engine_sensor_adc_UABH_A_SW_CA_TOP_REG                (*(engine_sensor_adc_UABH_A_SW_CA_TOP_PTR))

