uLipe/psoc_engine_sensor/engine_speed_sensor.cydsn/codegentemp/engine_sensor_adc_UABH_A_regs.h
#define engine_sensor_adc_UABH_A_SW_CB_IN0_ADDR                (engine_sensor_adc_UABH_A_halfuab__SW_CB_IN0)
#define engine_sensor_adc_UABH_A_SW_CB_IN0_PTR                ((reg32*)engine_sensor_adc_UABH_A_SW_CB_IN0_ADDR)
#define engine_sensor_adc_UABH_A_SW_CB_IN0_REG                (*(engine_sensor_adc_UABH_A_SW_CB_IN0_PTR))

#define engine_sensor_adc_UABH_A_SW_CB_IN1_ADDR                (engine_sensor_adc_UABH_A_halfuab__SW_CB_IN1)
#define engine_sensor_adc_UABH_A_SW_CB_IN1_PTR                ((reg32*)engine_sensor_adc_UABH_A_SW_CB_IN1_ADDR)
#define engine_sensor_adc_UABH_A_SW_CB_IN1_REG                (*(engine_sensor_adc_UABH_A_SW_CB_IN1_PTR))

#define engine_sensor_adc_UABH_A_SW_CB_TOP_ADDR                (engine_sensor_adc_UABH_A_halfuab__SW_CB_TOP)
#define engine_sensor_adc_UABH_A_SW_CB_TOP_PTR                ((reg32*)engine_sensor_adc_UABH_A_SW_CB_TOP_ADDR)
#define engine_sensor_adc_UABH_A_SW_CB_TOP_REG                (*(engine_sensor_adc_UABH_A_SW_CB_TOP_PTR))

#define engine_sensor_adc_UABH_A_SW_CC_IN0_ADDR                (engine_sensor_adc_UABH_A_halfuab__SW_CC_IN0)
#define engine_sensor_adc_UABH_A_SW_CC_IN0_PTR                ((reg32*)engine_sensor_adc_UABH_A_SW_CC_IN0_ADDR)
#define engine_sensor_adc_UABH_A_SW_CC_IN0_REG                (*(engine_sensor_adc_UABH_A_SW_CC_IN0_PTR))

#define engine_sensor_adc_UABH_A_SW_CC_IN1_ADDR                (engine_sensor_adc_UABH_A_halfuab__SW_CC_IN1)
#define engine_sensor_adc_UABH_A_SW_CC_IN1_PTR                ((reg32*)engine_sensor_adc_UABH_A_SW_CC_IN1_ADDR)
#define engine_sensor_adc_UABH_A_SW_CC_IN1_REG                (*(engine_sensor_adc_UABH_A_SW_CC_IN1_PTR))

#define engine_sensor_adc_UABH_A_SW_CC_TOP_ADDR                (engine_sensor_adc_UABH_A_halfuab__SW_CC_TOP)
#define engine_sensor_adc_UABH_A_SW_CC_TOP_PTR                ((reg32*)engine_sensor_adc_UABH_A_SW_CC_TOP_ADDR)
#define engine_sensor_adc_UABH_A_SW_CC_TOP_REG                (*(engine_sensor_adc_UABH_A_SW_CC_TOP_PTR))

#define engine_sensor_adc_UABH_A_SW_CF_BOT_ADDR                (engine_sensor_adc_UABH_A_halfuab__SW_CF_BOT)
#define engine_sensor_adc_UABH_A_SW_CF_BOT_PTR                ((reg32*)engine_sensor_adc_UABH_A_SW_CF_BOT_ADDR)
#define engine_sensor_adc_UABH_A_SW_CF_BOT_REG                (*(engine_sensor_adc_UABH_A_SW_CF_BOT_PTR))

#define engine_sensor_adc_UABH_A_SW_OTHER_ADDR                 (engine_sensor_adc_UABH_A_halfuab__SW_OTHER)
#define engine_sensor_adc_UABH_A_SW_OTHER_PTR                 ((reg32*)engine_sensor_adc_UABH_A_SW_OTHER_ADDR)
#define engine_sensor_adc_UABH_A_SW_OTHER_REG                 (*(engine_sensor_adc_UABH_A_SW_OTHER_PTR))

#define engine_sensor_adc_UABH_A_SW_BOOST_CTRL_ADDR            (engine_sensor_adc_UABH_A_halfuab__SW_BOOST_CTRL)
#define engine_sensor_adc_UABH_A_SW_BOOST_CTRL_PTR            ((reg32*)engine_sensor_adc_UABH_A_SW_BOOST_CTRL_ADDR)
#define engine_sensor_adc_UABH_A_SW_BOOST_CTRL_REG            (*(engine_sensor_adc_UABH_A_SW_BOOST_CTRL_PTR))

#define engine_sensor_adc_UABH_A_SRAM_CTRL_ADDR                (engine_sensor_adc_UABH_A_halfuab__SRAM_CTRL)
#define engine_sensor_adc_UABH_A_SRAM_CTRL_PTR                ((reg32*)engine_sensor_adc_UABH_A_SRAM_CTRL_ADDR)
#define engine_sensor_adc_UABH_A_SRAM_CTRL_REG                (*(engine_sensor_adc_UABH_A_SRAM_CTRL_PTR))

#define engine_sensor_adc_UABH_A_STAT_ADDR                     (engine_sensor_adc_UABH_A_halfuab__STAT)
#define engine_sensor_adc_UABH_A_STAT_PTR                     ((reg32*)engine_sensor_adc_UABH_A_STAT_ADDR)
#define engine_sensor_adc_UABH_A_STAT_REG                     (*(engine_sensor_adc_UABH_A_STAT_PTR))

#define engine_sensor_adc_UABH_A_SRAM0_ADDR                    (engine_sensor_adc_UABH_A_halfuab__SRAM0)
#define engine_sensor_adc_UABH_A_SRAM0_PTR                    ((reg32*)engine_sensor_adc_UABH_A_SRAM0_ADDR)
#define engine_sensor_adc_UABH_A_SRAM0_REG                    (*(engine_sensor_adc_UABH_A_SRAM0_PTR))

#define engine_sensor_adc_UABH_A_SRAM1_ADDR                    (engine_sensor_adc_UABH_A_halfuab__SRAM1)
#define engine_sensor_adc_UABH_A_SRAM1_PTR                    ((reg32*)engine_sensor_adc_UABH_A_SRAM1_ADDR)
#define engine_sensor_adc_UABH_A_SRAM1_REG                    (*(engine_sensor_adc_UABH_A_SRAM1_PTR))

#define engine_sensor_adc_UABH_A_SRAM2_ADDR                    (engine_sensor_adc_UABH_A_halfuab__SRAM2)
#define engine_sensor_adc_UABH_A_SRAM2_PTR                    ((reg32*)engine_sensor_adc_UABH_A_SRAM2_ADDR)
#define engine_sensor_adc_UABH_A_SRAM2_REG                    (*(engine_sensor_adc_UABH_A_SRAM2_PTR))

#define engine_sensor_adc_UABH_A_SRAM3_ADDR                    (engine_sensor_adc_UABH_A_halfuab__SRAM3)
#define engine_sensor_adc_UABH_A_SRAM3_PTR                    ((reg32*)engine_sensor_adc_UABH_A_SRAM3_ADDR)
#define engine_sensor_adc_UABH_A_SRAM3_REG                    (*(engine_sensor_adc_UABH_A_SRAM3_PTR))

#define engine_sensor_adc_UABH_A_SRAM4_ADDR                    (engine_sensor_adc_UABH_A_halfuab__SRAM4)
#define engine_sensor_adc_UABH_A_SRAM4_PTR                    ((reg32*)engine_sensor_adc_UABH_A_SRAM4_ADDR)
#define engine_sensor_adc_UABH_A_SRAM4_REG                    (*(engine_sensor_adc_UABH_A_SRAM4_PTR))

#define engine_sensor_adc_UABH_A_SRAM5_ADDR                    (engine_sensor_adc_UABH_A_halfuab__SRAM5)
#define engine_sensor_adc_UABH_A_SRAM5_PTR                    ((reg32*)engine_sensor_adc_UABH_A_SRAM5_ADDR)
#define engine_sensor_adc_UABH_A_SRAM5_REG                    (*(engine_sensor_adc_UABH_A_SRAM5_PTR))

#define engine_sensor_adc_UABH_A_SRAM6_ADDR                    (engine_sensor_adc_UABH_A_halfuab__SRAM6)
#define engine_sensor_adc_UABH_A_SRAM6_PTR                    ((reg32*)engine_sensor_adc_UABH_A_SRAM6_ADDR)
#define engine_sensor_adc_UABH_A_SRAM6_REG                    (*(engine_sensor_adc_UABH_A_SRAM6_PTR))

#define engine_sensor_adc_UABH_A_SRAM7_ADDR                    (engine_sensor_adc_UABH_A_halfuab__SRAM7)
#define engine_sensor_adc_UABH_A_SRAM7_PTR                    ((reg32*)engine_sensor_adc_UABH_A_SRAM7_ADDR)
#define engine_sensor_adc_UABH_A_SRAM7_REG                    (*(engine_sensor_adc_UABH_A_SRAM7_PTR))

#define engine_sensor_adc_UABH_A_SRAM8_ADDR                    (engine_sensor_adc_UABH_A_halfuab__SRAM8)
#define engine_sensor_adc_UABH_A_SRAM8_PTR                    ((reg32*)engine_sensor_adc_UABH_A_SRAM8_ADDR)
#define engine_sensor_adc_UABH_A_SRAM8_REG                    (*(engine_sensor_adc_UABH_A_SRAM8_PTR))

