uLipe/psoc_engine_sensor/engine_speed_sensor.cydsn/codegentemp/engine_sensor_adc_UABH_A_regs.h
#define engine_sensor_adc_UABH_A_UAB_PWR_SHIFT                CyUAB_UAB_PWR_SHIFT
#define engine_sensor_adc_UABH_A_UAB_PWR_MASK                 (0x3UL<<engine_sensor_adc_UABH_A_UAB_PWR_SHIFT)
#define engine_sensor_adc_UABH_A_UAB_PWR_NORMAL               (0UL)
#define engine_sensor_adc_UABH_A_UAB_PWR_ULTRA_LOW            (1UL)
#define engine_sensor_adc_UABH_A_UAB_PWR_ULTRA_HIGH           (2UL)
#define engine_sensor_adc_UABH_A_UAB_PWR_Reserved             (3UL)


/*CAP_CTRL*/
#define engine_sensor_adc_UABH_A_CB_GND_SHIFT                 CyUAB_CB_GND_SHIFT
#define engine_sensor_adc_UABH_A_CB_GND_MASK                  (1UL<<engine_sensor_adc_UABH_A_CB_GND_SHIFT)

#define engine_sensor_adc_UABH_A_CC_GND_SHIFT                 CyUAB_CC_GND_SHIFT
#define engine_sensor_adc_UABH_A_CC_GND_MASK                  (1UL<<engine_sensor_adc_UABH_A_CC_GND_SHIFT)

#define engine_sensor_adc_UABH_A_FRC_SIGN_BIT_SHIFT           CyUAB_FRC_SIGN_BIT_SHIFT
#define engine_sensor_adc_UABH_A_FRC_SIGN_BIT_MASK            (1UL<<CyUAB_FRC_SIGN_BIT_SHIFT)

#define engine_sensor_adc_UABH_A_DAC_MODE_EN_SHIFT            CyUAB_DAC_MODE_EN_SHIFT
#define engine_sensor_adc_UABH_A_DAC_MODE_EN_MASK             (1UL<<engine_sensor_adc_UABH_A_DAC_MODE_EN_SHIFT)

#define engine_sensor_adc_UABH_A_DAC_MODE_SHIFT               CyUAB_DAC_MODE_SHIFT
#define engine_sensor_adc_UABH_A_DAC_MODE_MASK                (0x3UL<<engine_sensor_adc_UABH_A_DAC_MODE_SHIFT)
#define engine_sensor_adc_UABH_A_DAC_MODE_UNSIGNED12          (0UL)
#define engine_sensor_adc_UABH_A_DAC_MODE_VIRT_SIGNED12       (1UL)
#define engine_sensor_adc_UABH_A_DAC_MODE_SIGNED13            (2UL)
#define engine_sensor_adc_UABH_A_DAC_MODE_RESERVED            (3UL)


/*CAP_ABCF_VAL, CAP_AB_VAL_NXT, and CAP_CF_VAL_NXT*/
#define engine_sensor_adc_UABH_A_CB_VAL_SHIFT                 CyUAB_CB_VAL_SHIFT
#define engine_sensor_adc_UABH_A_CB_VAL_MASK                  (0x3fUL<<engine_sensor_adc_UABH_A_CB_VAL_SHIFT)

#define engine_sensor_adc_UABH_A_CA_VAL_SHIFT                 CyUAB_CA_VAL_SHIFT
#define engine_sensor_adc_UABH_A_CA_VAL_MASK                  (0x3fUL<<engine_sensor_adc_UABH_A_CA_VAL_SHIFT)

#define engine_sensor_adc_UABH_A_SIGN_VAL_SHIFT               CyUAB_SIGN_VAL_SHIFT
#define engine_sensor_adc_UABH_A_SIGN_VAL_MASK                (1UL<<engine_sensor_adc_UABH_A_SIGN_VAL_SHIFT)

#define engine_sensor_adc_UABH_A_CB_64_SHIFT                  CyUAB_CB_64_SHIFT
#define engine_sensor_adc_UABH_A_CB_64_MASK                   (1UL<<engine_sensor_adc_UABH_A_CB_64_SHIFT)

#define engine_sensor_adc_UABH_A_CC_VAL_SHIFT                 CyUAB_CC_VAL_SHIFT
#define engine_sensor_adc_UABH_A_CC_VAL_MASK                  (0x3fUL<<engine_sensor_adc_UABH_A_CC_VAL_SHIFT)

#define engine_sensor_adc_UABH_A_CF_VAL_SHIFT                 CyUAB_CF_VAL_SHIFT
#define engine_sensor_adc_UABH_A_CF_VAL_MASK                  (0x1fUL<<engine_sensor_adc_UABH_A_CF_VAL_SHIFT)


/*CAP_CF_VAL_NXT*/
#define engine_sensor_adc_UABH_A_CC_VAL_UPDATE_SHIFT          CyUAB_CC_VAL_UPDATE_SHIFT
#define engine_sensor_adc_UABH_A_CC_VAL_UPDATE_MASK           (1UL<<engine_sensor_adc_UABH_A_CC_VAL_UPDATE_SHIFT)

#define engine_sensor_adc_UABH_A_CF_VAL_UPDATE_SHIFT          CyUAB_CF_VAL_UPDATE_SHIFT
#define engine_sensor_adc_UABH_A_CF_VAL_UPDATE_MASK           (1UL<<engine_sensor_adc_UABH_A_CF_VAL_UPDATE_SHIFT)


/*STARTUP_DELAY*/
#define engine_sensor_adc_UABH_A_STARTUP_DELAY_SHIFT          CyUAB_STARTUP_DELAY_SHIFT
#define engine_sensor_adc_UABH_A_STARTUP_DELAY_MASK           (0x0000ffffUL)

#define engine_sensor_adc_UABH_A_ALIGN_MODE_SHIFT             CyUAB_ALIGN_MODE_SHIFT
#define engine_sensor_adc_UABH_A_ALIGN_MODE_MASK              (1UL<<engine_sensor_adc_UABH_A_ALIGN_MODE_SHIFT)


/*SUBSAMPLE_CTRL*/
#define engine_sensor_adc_UABH_A_SUBSAMPLE_SHIFT              CyUAB_SUBSAMPLE_SHIFT
#define engine_sensor_adc_UABH_A_SUBSAMPLE_MASK               (0xffUL<<engine_sensor_adc_UABH_A_SUBSAMPLE_SHIFT)

#define engine_sensor_adc_UABH_A_SUBSAMPLE_INIT_SHIFT         CyUAB_SUBSAMPLE_INIT_SHIFT
#define engine_sensor_adc_UABH_A_SUBSAMPLE_INIT_MASK          (0xffUL<<engine_sensor_adc_UABH_A_SUBSAMPLE_INIT_SHIFT)


/*SW_STATIC*/
#define engine_sensor_adc_UABH_A_SW_G0_SHIFT                  CyUAB_SW_G0_SHIFT
#define engine_sensor_adc_UABH_A_SW_G0_MASK                   (1UL<<engine_sensor_adc_UABH_A_SW_G0_SHIFT)

#define engine_sensor_adc_UABH_A_SW_G1_SHIFT                  CyUAB_SW_G1_SHIFT
#define engine_sensor_adc_UABH_A_SW_G1_MASK                   (1UL<<engine_sensor_adc_UABH_A_SW_G1_SHIFT)

#define engine_sensor_adc_UABH_A_SW_G2_SHIFT                  CyUAB_SW_G2_SHIFT
#define engine_sensor_adc_UABH_A_SW_G2_MASK                   (1UL<<engine_sensor_adc_UABH_A_SW_G2_SHIFT)

#define engine_sensor_adc_UABH_A_SW_G3_SHIFT                  CyUAB_SW_G3_SHIFT
#define engine_sensor_adc_UABH_A_SW_G3_MASK                   (1UL<<engine_sensor_adc_UABH_A_SW_G3_SHIFT)

#define engine_sensor_adc_UABH_A_SW_RG_SHIFT                  CyUAB_SW_RG_SHIFT
#define engine_sensor_adc_UABH_A_SW_RG_MASK                   (1UL<<engine_sensor_adc_UABH_A_SW_RG_SHIFT)

#define engine_sensor_adc_UABH_A_SW_GG_SHIFT                  CyUAB_SW_GG_SHIFT
#define engine_sensor_adc_UABH_A_SW_GG_MASK                   (1UL<<engine_sensor_adc_UABH_A_SW_GG_SHIFT)

#define engine_sensor_adc_UABH_A_SW_RT_SHIFT                  CyUAB_SW_RT_SHIFT
#define engine_sensor_adc_UABH_A_SW_RT_MASK                   (1UL<<engine_sensor_adc_UABH_A_SW_RT_SHIFT)

#define engine_sensor_adc_UABH_A_SW_GT_SHIFT                  CyUAB_SW_GT_SHIFT
#define engine_sensor_adc_UABH_A_SW_GT_MASK                   (1UL<<engine_sensor_adc_UABH_A_SW_GT_SHIFT)

#define engine_sensor_adc_UABH_A_SW_QT_SHIFT                  CyUAB_SW_QT_SHIFT
#define engine_sensor_adc_UABH_A_SW_QT_MASK                   (1UL<<engine_sensor_adc_UABH_A_SW_QT_SHIFT)

#define engine_sensor_adc_UABH_A_EARLY_PS_SHIFT               CyUAB_EARLY_PS_SHIFT
#define engine_sensor_adc_UABH_A_EARLY_PS_MASK                (1UL<<engine_sensor_adc_UABH_A_EARLY_PS_SHIFT)

