uLipe/psoc_engine_sensor/engine_speed_sensor.cydsn/codegentemp/engine_sensor_adc_UABH_A_regs.h
#define engine_sensor_adc_UABH_A_EARLY_PO_SHIFT               CyUAB_EARLY_PO_SHIFT
#define engine_sensor_adc_UABH_A_EARLY_PO_MASK                (1UL<<engine_sensor_adc_UABH_A_EARLY_PO_SHIFT)

#define engine_sensor_adc_UABH_A_STRB_RST_SEL_SHIFT           CyUAB_STRB_RST_SEL_SHIFT
#define engine_sensor_adc_UABH_A_STRB_RST_SEL_MASK            (0x1fUL<<engine_sensor_adc_UABH_A_STRB_RST_SEL_SHIFT)

#define engine_sensor_adc_UABH_A_STRB_RST_EN_SHIFT            CyUAB_STRB_RST_EN_SHIFT
#define engine_sensor_adc_UABH_A_STRB_RST_EN_MASK             (1UL<<engine_sensor_adc_UABH_A_STRB_RST_EN_SHIFT)


/*SW_MODBIT_SRC*/
#define engine_sensor_adc_UABH_A_MODBIT0_SRC_SEL_SHIFT        CyUAB_MODBIT0_SRC_SEL_SHIFT
#define engine_sensor_adc_UABH_A_MODBIT0_SRC_SEL_MASK         (0x1fUL<<engine_sensor_adc_UABH_A_MODBIT0_SRC_SEL_SHIFT)

#define engine_sensor_adc_UABH_A_MODBIT1_SRC_SEL_SHIFT        CyUAB_MODBIT1_SRC_SEL_SHIFT
#define engine_sensor_adc_UABH_A_MODBIT1_SRC_SEL_MASK         (0x1fUL<<engine_sensor_adc_UABH_A_MODBIT1_SRC_SEL_SHIFT)


/*SW_CA_IN0*/
#define engine_sensor_adc_UABH_A_SW_A0_MODBIT_SHIFT           CyUAB_SW_A0_MODBIT_SHIFT
#define engine_sensor_adc_UABH_A_SW_A0_MODBIT_MASK            (0xfUL<<engine_sensor_adc_UABH_A_SW_A0_MODBIT_SHIFT)

#define engine_sensor_adc_UABH_A_SW_A1_MODBIT_SHIFT           CyUAB_SW_A1_MODBIT_SHIFT
#define engine_sensor_adc_UABH_A_SW_A1_MODBIT_MASK            (0xfUL<<engine_sensor_adc_UABH_A_SW_A1_MODBIT_SHIFT)

#define engine_sensor_adc_UABH_A_SW_A2_MODBIT_SHIFT           CyUAB_SW_A2_MODBIT_SHIFT
#define engine_sensor_adc_UABH_A_SW_A2_MODBIT_MASK            (0xfUL<<engine_sensor_adc_UABH_A_SW_A2_MODBIT_SHIFT)

#define engine_sensor_adc_UABH_A_SW_A3_MODBIT_SHIFT           CyUAB_SW_A3_MODBIT_SHIFT
#define engine_sensor_adc_UABH_A_SW_A3_MODBIT_MASK            (0xfUL<<engine_sensor_adc_UABH_A_SW_A3_MODBIT_SHIFT)

#define engine_sensor_adc_UABH_A_SW_AP_SHIFT                  CyUAB_SW_AP_SHIFT
#define engine_sensor_adc_UABH_A_SW_AP_MASK                   (0xfUL<<engine_sensor_adc_UABH_A_SW_AP_SHIFT)

#define engine_sensor_adc_UABH_A_SW_AQ_SHIFT                  CyUAB_SW_AQ_SHIFT
#define engine_sensor_adc_UABH_A_SW_AQ_MASK                   (0xfUL<<engine_sensor_adc_UABH_A_SW_AQ_SHIFT)

/*SW_CA_IN1*/    
#define engine_sensor_adc_UABH_A_SW_AA_SHIFT                  CyUAB_SW_AA_SHIFT
#define engine_sensor_adc_UABH_A_SW_AA_MASK                   (0xfUL<<engine_sensor_adc_UABH_A_SW_AA_SHIFT)

#define engine_sensor_adc_UABH_A_SW_AR_MODBIT_SHIFT           CyUAB_SW_AR_MODBIT_SHIFT
#define engine_sensor_adc_UABH_A_SW_AR_MODBIT_MASK            (0xfUL<<engine_sensor_adc_UABH_A_SW_AR_MODBIT_SHIFT)

#define engine_sensor_adc_UABH_A_SW_AG_MODBIT_SHIFT           CyUAB_SW_AG_MODBIT_SHIFT
#define engine_sensor_adc_UABH_A_SW_AG_MODBIT_MASK            (0xfUL<<engine_sensor_adc_UABH_A_SW_AG_MODBIT_SHIFT)

#define engine_sensor_adc_UABH_A_SW_AV_MODBIT_SHIFT           CyUAB_SW_AV_MODBIT_SHIFT
#define engine_sensor_adc_UABH_A_SW_AV_MODBIT_MASK            (0xfUL<<engine_sensor_adc_UABH_A_SW_AV_MODBIT_SHIFT)


/*SW_CA_TOP*/
#define engine_sensor_adc_UABH_A_SW_RA_MODBIT_SHIFT           CyUAB_SW_RA_MODBIT_SHIFT
#define engine_sensor_adc_UABH_A_SW_RA_MODBIT_MASK            (0xfUL<<engine_sensor_adc_UABH_A_SW_RA_MODBIT_SHIFT)

#define engine_sensor_adc_UABH_A_SW_GA_MODBIT_SHIFT           CyUAB_SW_GA_MODBIT_SHIFT
#define engine_sensor_adc_UABH_A_SW_GA_MODBIT_MASK            (0xfUL<<engine_sensor_adc_UABH_A_SW_GA_MODBIT_SHIFT)

#define engine_sensor_adc_UABH_A_SW_VA_MODBIT_SHIFT           CyUAB_SW_VA_MODBIT_SHIFT
#define engine_sensor_adc_UABH_A_SW_VA_MODBIT_MASK            (0xfUL<<engine_sensor_adc_UABH_A_SW_VA_MODBIT_SHIFT)

#define engine_sensor_adc_UABH_A_SW_SA_SHIFT                  CyUAB_SW_SA_SHIFT
#define engine_sensor_adc_UABH_A_SW_SA_MASK                   (0xfUL<<engine_sensor_adc_UABH_A_SW_SA_SHIFT)


/*SW_CB_IN0*/
#define engine_sensor_adc_UABH_A_SW_B0_MODBIT_SHIFT           CyUAB_SW_B0_MODBIT_SHIFT
#define engine_sensor_adc_UABH_A_SW_B0_MODBIT_MASK            (0xfUL<<engine_sensor_adc_UABH_A_SW_B0_MODBIT_SHIFT)

#define engine_sensor_adc_UABH_A_SW_B1_MODBIT_SHIFT           CyUAB_SW_B1_MODBIT_SHIFT
#define engine_sensor_adc_UABH_A_SW_B1_MODBIT_MASK            (0xfUL<<engine_sensor_adc_UABH_A_SW_B1_MODBIT_SHIFT)

#define engine_sensor_adc_UABH_A_SW_B2_MODBIT_SHIFT           CyUAB_SW_B2_MODBIT_SHIFT
#define engine_sensor_adc_UABH_A_SW_B2_MODBIT_MASK            (0xfUL<<engine_sensor_adc_UABH_A_SW_B2_MODBIT_SHIFT)

#define engine_sensor_adc_UABH_A_SW_B3_MODBIT_SHIFT           CyUAB_SW_B3_MODBIT_SHIFT
#define engine_sensor_adc_UABH_A_SW_B3_MODBIT_MASK            (0xfUL<<engine_sensor_adc_UABH_A_SW_B3_MODBIT_SHIFT)

#define engine_sensor_adc_UABH_A_SW_BP_SHIFT                  CyUAB_SW_BP_SHIFT
#define engine_sensor_adc_UABH_A_SW_BP_MASK                   (0xfUL<<engine_sensor_adc_UABH_A_SW_BP_SHIFT)

#define engine_sensor_adc_UABH_A_SW_BQ_SHIFT                  CyUAB_SW_BQ_SHIFT
#define engine_sensor_adc_UABH_A_SW_BQ_MASK                   (0xfUL<<engine_sensor_adc_UABH_A_SW_BQ_SHIFT)


/*SW_CB_IN1*/
#define engine_sensor_adc_UABH_A_SW_BB_SHIFT                  CyUAB_SW_BB_SHIFT
#define engine_sensor_adc_UABH_A_SW_BB_MASK                   (0xfUL<<engine_sensor_adc_UABH_A_SW_BB_SHIFT)

#define engine_sensor_adc_UABH_A_SW_BR_MODBIT_SHIFT           CyUAB_SW_BR_MODBIT_SHIFT
#define engine_sensor_adc_UABH_A_SW_BR_MODBIT_MASK            (0xfUL<<engine_sensor_adc_UABH_A_SW_BR_MODBIT_SHIFT)

#define engine_sensor_adc_UABH_A_SW_BG_MODBIT_SHIFT           CyUAB_SW_BG_MODBIT_SHIFT
#define engine_sensor_adc_UABH_A_SW_BG_MODBIT_MASK            (0xfUL<<engine_sensor_adc_UABH_A_SW_BG_MODBIT_SHIFT)

#define engine_sensor_adc_UABH_A_SW_BV_MODBIT_SHIFT           CyUAB_SW_BV_MODBIT_SHIFT
#define engine_sensor_adc_UABH_A_SW_BV_MODBIT_MASK            (0xfUL<<engine_sensor_adc_UABH_A_SW_BV_MODBIT_SHIFT)


/*SW_CB_TOP*/
#define engine_sensor_adc_UABH_A_SW_RB_MODBIT_SHIFT           CyUAB_SW_RB_MODBIT_SHIFT
#define engine_sensor_adc_UABH_A_SW_RB_MODBIT_MASK            (0xfUL<<engine_sensor_adc_UABH_A_SW_RB_MODBIT_SHIFT)

#define engine_sensor_adc_UABH_A_SW_GB_MODBIT_SHIFT           CyUAB_SW_GB_MODBIT_SHIFT
#define engine_sensor_adc_UABH_A_SW_GB_MODBIT_MASK            (0xfUL<<engine_sensor_adc_UABH_A_SW_GB_MODBIT_SHIFT)

#define engine_sensor_adc_UABH_A_SW_VB_MODBIT_SHIFT           CyUAB_SW_VB_MODBIT_SHIFT
#define engine_sensor_adc_UABH_A_SW_VB_MODBIT_MASK            (0xfUL<<engine_sensor_adc_UABH_A_SW_VB_MODBIT_SHIFT)

#define engine_sensor_adc_UABH_A_SW_TB_SHIFT                  CyUAB_SW_TB_SHIFT
#define engine_sensor_adc_UABH_A_SW_TB_MASK                   (0xfUL<<engine_sensor_adc_UABH_A_SW_TB_SHIFT)

