uLipe/psoc_engine_sensor/engine_speed_sensor.cydsn/codegentemp/engine_sensor_adc_UABH_A_regs.h
#define engine_sensor_adc_UABH_A_SW_SB_SHIFT                  CyUAB_SW_SB_SHIFT
#define engine_sensor_adc_UABH_A_SW_SB_MASK                   (0xfUL<<engine_sensor_adc_UABH_A_SW_SB_SHIFT)


/*SW_CC_IN0*/
#define engine_sensor_adc_UABH_A_SW_C0_MODBIT_SHIFT           CyUAB_SW_C0_MODBIT_SHIFT
#define engine_sensor_adc_UABH_A_SW_C0_MODBIT_MASK            (0xfUL<<engine_sensor_adc_UABH_A_SW_C0_MODBIT_SHIFT)

#define engine_sensor_adc_UABH_A_SW_C1_MODBIT_SHIFT           CyUAB_SW_C1_MODBIT_SHIFT
#define engine_sensor_adc_UABH_A_SW_C1_MODBIT_MASK            (0xfUL<<engine_sensor_adc_UABH_A_SW_C1_MODBIT_SHIFT)

#define engine_sensor_adc_UABH_A_SW_C2_MODBIT_SHIFT           CyUAB_SW_C2_MODBIT_SHIFT
#define engine_sensor_adc_UABH_A_SW_C2_MODBIT_MASK            (0xfUL<<engine_sensor_adc_UABH_A_SW_C2_MODBIT_SHIFT)

#define engine_sensor_adc_UABH_A_SW_C3_MODBIT_SHIFT           CyUAB_SW_C3_MODBIT_SHIFT
#define engine_sensor_adc_UABH_A_SW_C3_MODBIT_MASK            (0xfUL<<engine_sensor_adc_UABH_A_SW_C3_MODBIT_SHIFT)

#define engine_sensor_adc_UABH_A_SW_CP_SHIFT                  CyUAB_SW_CP_SHIFT
#define engine_sensor_adc_UABH_A_SW_CP_MASK                   (0xfUL<<engine_sensor_adc_UABH_A_SW_CP_SHIFT)

#define engine_sensor_adc_UABH_A_SW_CQ_SHIFT                  CyUAB_SW_CQ_SHIFT
#define engine_sensor_adc_UABH_A_SW_CQ_MASK                   (0xfUL<<engine_sensor_adc_UABH_A_SW_CQ_SHIFT)


/*SW_CC_IN1*/
#define engine_sensor_adc_UABH_A_SW_CC_SHIFT                  CyUAB_SW_CC_SHIFT
#define engine_sensor_adc_UABH_A_SW_CC_MASK                   (0xfUL<<engine_sensor_adc_UABH_A_SW_CC_SHIFT)

#define engine_sensor_adc_UABH_A_SW_CR_MODBIT_SHIFT           CyUAB_SW_CR_MODBIT_SHIFT
#define engine_sensor_adc_UABH_A_SW_CR_MODBIT_MASK            (0xfUL<<engine_sensor_adc_UABH_A_SW_CR_MODBIT_SHIFT)

#define engine_sensor_adc_UABH_A_SW_CG_MODBIT_SHIFT           CyUAB_SW_CG_MODBIT_SHIFT
#define engine_sensor_adc_UABH_A_SW_CG_MODBIT_MASK            (0xfUL<<engine_sensor_adc_UABH_A_SW_CG_MODBIT_SHIFT)

#define engine_sensor_adc_UABH_A_SW_CV_MODBIT_SHIFT           CyUAB_SW_CV_MODBIT_SHIFT
#define engine_sensor_adc_UABH_A_SW_CV_MODBIT_MASK            (0xfUL<<engine_sensor_adc_UABH_A_SW_CV_MODBIT_SHIFT)


/*SW_CC_TOP*/
#define engine_sensor_adc_UABH_A_SW_RC_MODBIT_SHIFT           CyUAB_SW_RC_MODBIT_SHIFT
#define engine_sensor_adc_UABH_A_SW_RC_MODBIT_MASK            (0xfUL<<engine_sensor_adc_UABH_A_SW_RC_MODBIT_SHIFT)

#define engine_sensor_adc_UABH_A_SW_GC_MODBIT_SHIFT           CyUAB_SW_GC_MODBIT_SHIFT
#define engine_sensor_adc_UABH_A_SW_GC_MODBIT_MASK            (0xfUL<<engine_sensor_adc_UABH_A_SW_GC_MODBIT_SHIFT)

#define engine_sensor_adc_UABH_A_SW_VC_MODBIT_SHIFT           CyUAB_SW_VC_MODBIT_SHIFT
#define engine_sensor_adc_UABH_A_SW_VC_MODBIT_MASK            (0xfUL<<engine_sensor_adc_UABH_A_SW_VC_MODBIT_SHIFT)

#define engine_sensor_adc_UABH_A_SW_TC_SHIFT                  CyUAB_SW_TC_SHIFT
#define engine_sensor_adc_UABH_A_SW_TC_MASK                   (0xfUL<<engine_sensor_adc_UABH_A_SW_TC_SHIFT)

#define engine_sensor_adc_UABH_A_SW_SC_SHIFT                  CyUAB_SW_SC_SHIFT
#define engine_sensor_adc_UABH_A_SW_SC_MASK                   (0xfUL<<engine_sensor_adc_UABH_A_SW_SC_SHIFT)

#define engine_sensor_adc_UABH_A_SW_ZC_SHIFT                  CyUAB_SW_ZC_SHIFT
#define engine_sensor_adc_UABH_A_SW_ZC_MASK                   (0xfUL<<engine_sensor_adc_UABH_A_SW_ZC_SHIFT)


/*SW_CF_BOT*/
#define engine_sensor_adc_UABH_A_SW_GF_SHIFT                  CyUAB_SW_GF_SHIFT
#define engine_sensor_adc_UABH_A_SW_GF_MASK                   (0xfUL<<engine_sensor_adc_UABH_A_SW_GF_SHIFT)

#define engine_sensor_adc_UABH_A_SW_PF_SHIFT                  CyUAB_SW_PF_SHIFT
#define engine_sensor_adc_UABH_A_SW_PF_MASK                   (0xfUL<<engine_sensor_adc_UABH_A_SW_PF_SHIFT)

#define engine_sensor_adc_UABH_A_SW_PS_SHIFT                  CyUAB_SW_PS_SHIFT
#define engine_sensor_adc_UABH_A_SW_PS_MASK                   (0xfUL<<engine_sensor_adc_UABH_A_SW_PS_SHIFT)

#define engine_sensor_adc_UABH_A_SW_PO_SHIFT                  CyUAB_SW_PO_SHIFT
#define engine_sensor_adc_UABH_A_SW_PO_MASK                   (0xfUL<<engine_sensor_adc_UABH_A_SW_PO_SHIFT)


/*SW_OTHER*/
#define engine_sensor_adc_UABH_A_CMP_FF_SHIFT                 CyUAB_CMP_FF_SHIFT
#define engine_sensor_adc_UABH_A_CMP_FF_MASK                  (0xfUL<<engine_sensor_adc_UABH_A_CMP_FF_SHIFT)

#define engine_sensor_adc_UABH_A_VALID_SHIFT                  CyUAB_VALID_SHIFT
#define engine_sensor_adc_UABH_A_VALID_MASK                   (0xfUL<<engine_sensor_adc_UABH_A_VALID_SHIFT)

#define engine_sensor_adc_UABH_A_TRIG_OUT_SHIFT               CyUAB_TRIG_OUT_SHIFT
#define engine_sensor_adc_UABH_A_TRIG_OUT_MASK                (0xfUL<<engine_sensor_adc_UABH_A_TRIG_OUT_SHIFT)

#define engine_sensor_adc_UABH_A_STROBE_SW_SHIFT              CyUAB_STROBE_SW_SHIFT
#define engine_sensor_adc_UABH_A_STROBE_SW_MASK               (0xfUL<<engine_sensor_adc_UABH_A_STROBE_SW_SHIFT)

#define engine_sensor_adc_UABH_A_STROBE_RST_SHIFT             CyUAB_STROBE_RST_SHIFT
#define engine_sensor_adc_UABH_A_STROBE_RST_MASK              (0xfUL<<engine_sensor_adc_UABH_A_STROBE_RST_SHIFT)


/*SW_BOOST_CTRL*/
#define engine_sensor_adc_UABH_A_CA_BOOST_SHIFT               CyUAB_CA_BOOST_SHIFT
#define engine_sensor_adc_UABH_A_CA_BOOST_MASK                (0xfUL<<engine_sensor_adc_UABH_A_CA_BOOST_SHIFT)

#define engine_sensor_adc_UABH_A_CB_BOOST_SHIFT               CyUAB_CB_BOOST_SHIFT
#define engine_sensor_adc_UABH_A_CB_BOOST_MASK                (0xfUL<<engine_sensor_adc_UABH_A_CB_BOOST_SHIFT)

#define engine_sensor_adc_UABH_A_CC_BOOST_SHIFT               CyUAB_CC_BOOST_SHIFT
#define engine_sensor_adc_UABH_A_CC_BOOST_MASK                (0xfUL<<engine_sensor_adc_UABH_A_CC_BOOST_SHIFT)

#define engine_sensor_adc_UABH_A_CF_BOOST_SHIFT               CyUAB_CF_BOOST_SHIFT
#define engine_sensor_adc_UABH_A_CF_BOOST_MASK                (0xfUL<<engine_sensor_adc_UABH_A_CF_BOOST_SHIFT)

#define engine_sensor_adc_UABH_A_SUM_BOOST_SHIFT              CyUAB_SUM_BOOST_SHIFT
#define engine_sensor_adc_UABH_A_SUM_BOOST_MASK               (0xfUL<<engine_sensor_adc_UABH_A_SUM_BOOST_SHIFT)

#define engine_sensor_adc_UABH_A_PUMP_WAVE_SHIFT              CyUAB_PUMP_WAVE_SHIFT
#define engine_sensor_adc_UABH_A_PUMP_WAVE_MASK               (0xfUL<<engine_sensor_adc_UABH_A_PUMP_WAVE_SHIFT)


