uLipe/psoc_engine_sensor/engine_speed_sensor.cydsn/codegentemp/engine_sensor_adc_UABH_A_regs.h
/*SRAM_CTRL*/
#define engine_sensor_adc_UABH_A_LAST_STEP_SHIFT              CyUAB_LAST_STEP_SHIFT
#define engine_sensor_adc_UABH_A_LAST_STEP_MASK               (0xfUL<<engine_sensor_adc_UABH_A_LAST_STEP_SHIFT)

#define engine_sensor_adc_UABH_A_TRIG_SEL_SHIFT               CyUAB_TRIG_SEL_SHIFT
#define engine_sensor_adc_UABH_A_TRIG_SEL_MASK                (0x1fUL<<engine_sensor_adc_UABH_A_TRIG_SEL_SHIFT)

#define engine_sensor_adc_UABH_A_TRIGGER_EN_SHIFT             CyUAB_TRIGGER_EN_SHIFT
#define engine_sensor_adc_UABH_A_TRIGGER_EN_MASK              (1UL<<engine_sensor_adc_UABH_A_TRIGGER_EN_SHIFT)

#define engine_sensor_adc_UABH_A_RUN_SHIFT                    CyUAB_RUN_SHIFT
#define engine_sensor_adc_UABH_A_RUN_MASK                     (1UL<<engine_sensor_adc_UABH_A_RUN_SHIFT)


/*STAT*/
#define engine_sensor_adc_UABH_A_CURR_STEP_SHIFT              CyUAB_CURR_STEP_SHIFT
#define engine_sensor_adc_UABH_A_CURR_STEP_MASK               (0xfUL<<engine_sensor_adc_UABH_A_CURR_STEP_SHIFT)

#define engine_sensor_adc_UABH_A_COMP_SHIFT                   CyUAB_COMP_SHIFT
#define engine_sensor_adc_UABH_A_COMP_MASK                    (1UL<<engine_sensor_adc_UABH_A_COMP_SHIFT)

#define engine_sensor_adc_UABH_A_CURR_SUBSAMPLE_SHIFT         CyUAB_CURR_SUBSAMPLE_SHIFT
#define engine_sensor_adc_UABH_A_CURR_SUBSAMPLE_MASK          (0xffUL<<engine_sensor_adc_UABH_A_CURR_SUBSAMPLE_SHIFT)


/*SRAM*/
#define engine_sensor_adc_UABH_A_WAVE_STEP_SHIFT              CyUAB_WAVE_STEP_SHIFT
#define engine_sensor_adc_UABH_A_WAVE_STEP_MASK               (0x0000ffffUL)


/*CAP_TRIM*/
#define engine_sensor_adc_UABH_A_CBTC_VAL_SHIFT               CyUAB_CBTC_VAL_SHIFT
#define engine_sensor_adc_UABH_A_CBTC_VAL_MASK                (0x7UL<<engine_sensor_adc_UABH_A_CBTC_VAL_SHIFT)

#define engine_sensor_adc_UABH_A_CCTC_VAL_SHIFT               CyUAB_CCTC_VAL_SHIFT
#define engine_sensor_adc_UABH_A_CCTC_VAL_MASK                (0x7UL<<engine_sensor_adc_UABH_A_CCTC_VAL_SHIFT)


/*OA_TRIM*/
#define engine_sensor_adc_UABH_A_OA_OFFSET_SHIFT              CyUAB_OA_OFFSET_SHIFT
#define engine_sensor_adc_UABH_A_OA_OFFSET_MASK               (0xfUL<<engine_sensor_adc_UABH_A_OA_OFFSET_SHIFT)

#define engine_sensor_adc_UABH_A_REF_OFFSET_SHIFT             CyUAB_REF_OFFSET_SHIFT
#define engine_sensor_adc_UABH_A_REF_OFFSET_MASK              (0x1fUL<<engine_sensor_adc_UABH_A_REF_OFFSET_SHIFT)

#define engine_sensor_adc_UABH_A_AGND_OFFSET_SHIFT            CyUAB_AGND_OFFSET_SHIFT
#define engine_sensor_adc_UABH_A_AGND_OFFSET_MASK             (0x1fUL<<engine_sensor_adc_UABH_A_AGND_OFFSET_SHIFT)



#define engine_sensor_adc_UABH_A_DAC_NEXT_MASK (CyUAB_DAC_NEXT_MASK)


#endif
